Repository: elite-projekt/demonstrations
Catalog: native/nativeapp/utils/locale/locales/*/LC_MESSAGES/*.po
Languages: de

# running
source: Demo is running
de: Demo läuft

# starting
source: Starting Demo
de: Demo startet

# ready
source: Demo Ready
de: Bereit

source: Error
de: Fehler

source: Start Demo
de: Demo starten

source: Stop Demo
de: Demo stoppen

source: Beginner
de: Leicht

source: Intermediate
de: Mittel

# container_start_state
source: Constructing Container
de: Erstelle Container

# container_stop_state
source: Tearing down Container
de: Stoppe Container

# application_start_state
source: Preparing Applications
de: Starte Programme

# application_stop_state
source: Killing Applications
de: Stoppe Programme

# stopping
source: Stopping Demo
de: Demo stoppt

# start_offline
source: Start Demo
de: Starte Demo

# start_waiting
source: Waiting for data
de: Warte auf Antwort

# start_error
source: Error
de: Fehler in Demo

# start_ready
source: Open demo
de: Demo öffnen

# start_running
source: Demo running
de: Demo läuft

# start_stopping
source: Stopping
de: Demo Stoppt

# stop_button
source: Stop Demo
de: Demo stoppen

# learn_button
source: Learning Material
de: Lernmaterial

# ready_button
source: Demo Ready
de: Demo bereit

# tooltip_time
source: Estimated time to complete the Demo
de: Benötigte Zeit für die Demo

# tooltip_difficulty
source: Estimated difficulty of the Demo
de: Schwierigkeit der Demo

# tooltip_hardware
source: Hardware required to complete the Demo
de: Benötigte Hardware

source: Wifi-Stick
de: WLAN-Stick

# guide_intro
source: Introduction
de: Einführung

# guide_task
source: Task
de: Aufgabenstellung

# guide_goal
source: Goal
de: Ziel der Demo

# guide_req
source: Requirements
de: Besondere Anforderungen der Demo

# demo_error
source: Demo failed
de: Leider ist bei dieser Demo ein unerwarteter Fehler aufgetreten. Bitten wenden Sie sich an den Support oder starten Sie eine andere Demo

# error_code
source: Error message
de: Fehlermeldung

# survey_other
source: Other comments
de: Weitere Kommentare

# survey_cancel_button
source: Cancel
de: Abbrechen

# survey_send_button
source: Send Answers
de: Feedback Senden

# survey_title
source: Survey for demo
de: Feedback für Demo

# survey_question_demo_like
source: How would you rate your experience with the demo?
de: Wie würden Sie die Demo bewerten?

# survey_question_demo_realistic
source: How would you rate the realism of the demo?
de: Wie realistisch empfanden Sie die Demo?

# survey_question_it_knowledge
source: How would you rate your own knowledge in the area of IT security?
de: Wie schätzen Sie Ihr eigenes Wissen im Bereich IT-Security ein?

# survey_question_danger
source: Do you assess the threat situation in IT differently after the demo?
de: Schätzen Sie die Gefahrenlage nach der Demo anders ein?

# survey_question_length
source: Is the length of the demo appropriate?
de: Ist die Länge der Demo angemessen?
