Repository: elite-projekt/demonstrations
Catalog: demos/uhh_usb_ransomware/locales/*/LC_MESSAGES/*.po
Languages: de

# end_demo_text
source: End demo
de: Demo beenden

# uhh_crash_text
source: You connected a malicious USB device which destroyed the PC This device puts -220V on the data lines and damages the PC by doing so. Since this is only a simulation you can end the demonstration by using the button below.
de: Sie haben einen modifizierten USB-Stick an den Rechner anschlossen, welcher diesen Zerstört hat. Dieser Stick entlädt kontinuierlich -220V auf die Datenleitungen und zerstört so den PC. Da es sich nur um eine Simulation handelt, ist der PC selbstverständlich nicht defekt und Sie können die Demo beenden.

# uhh_picture_mail_subject
source: Urgent! I need the current payroll!
de: Dringend! Ich benötige die aktuelle Gehaltsliste!

# uhh_picture_mail_content
source: Hello Max, I urgently need the current payroll. Since you proudly claimed that the current version is currently on your desktop, I hope that you are the correct person to talk to. Unfortunately, we are not allowed to send sensitive data by e-mail. Could you copy the file to a USB stick? I left one on at your workstation. Please excuse the inconvenience. Thank you very much and best regards Christina
de: Hallo Max, ich benötige ganz dringend die aktuelle Gehaltsliste. Gestern hast du ja noch stolz behauptet, dass die aktuelle Version momentan bei dir auf dem Desktop liegt, daher hoffe ich, dass ich bei dir richtig bin. Könntest du mir die daher auf einen USB-Stick kopieren? Ich habe dir vorhin einen an einen Arbeitsplatz gelegt. Wir dürfen ja leider keine sensiblen Daten per E-Mail versenden. Entschuldige bitte die Umstände. Vielen Dank und liebe Grüße Christina

# file_one
source: My recommendation would be to renovate the entire place.
de: Mein Vorschlag ist, dass wir die Firma grundsanieren lassen.

# file_two
source: I do not think it is a good idea to change anything. In my opinion, our office already looks good the way it is.
de: Ich denke, es ist keine gute Idee, etwas neu zu machen. Ich finde unsere Firma ist bereits gut eingerichtet.

# file_three
source: In my opinion we should all gather and make a decision together. Together, we can make the best decision for everyone.
de: Meiner Meinung nach sollten wir uns einfach zusammensetzen. Zusammen kann man bekanntlich besser Entscheidungen finden.

# end_text
source: Your PC was infected with ransomware
de: Ihr PC ist einem Ransomware Angriff zum Opfer gefallen

# uhh_usb_ransomware_description
source: This demo shows the dangers of tampered USB sticks and how they can cause immediate damage to the PC's filesystem.
de: Diese Demo zeigt die Gefahren von durch manipulierte USB-Sticks auf und wie diese mit Ransomware infiziert sein können.

# uhh_usb_ransomware_guide_intro
source: In this demo you will learn about the dangers of unknown USB devices and what damage they can cause.
de: In dieser Demo lernen Sie die Gefahren von unbekannten USB-Geräten kennen und welchen Schaden diese anrichten können.

# uhh_usb_ransomware_guide_goal
source: At the end of the demo, not everything will run as you expect. However, this is planned. The demo ends when files on the desktop have been encrypted and the background picture has changed.
de: Am Ende der Demo wird nicht alles so laufen, wie Sie es erwarten. Das ist jedoch geplant. Die Demo endet, wenn die Dateien auf Ihrem Desktop verschlüsselt sind und das Hintergrundbild geändert ist.

# uhh_usb_ransomware_guide_req
source: This demo requires a demonstration USB stick, which will be given to you by our presenters.
de: Für diese Demo wird ein Demonstrations-USB-Stick benötigt, der Ihnen von unseren Moderatoren ausgehändigt wird.

# uhh_usb_ransomware_guide_task
source: Your task in this demo is to follow the instructions in the emails from Christina Sauer. She will ask you to insert a USB stick that she has sent you into your demonstration computer and with that access, check files on your desktop.
de: Ihre Aufgabe in dieser Demo besteht darin, der Anleitung in den E-Mails von Christina Sauer zu folgen. Sie wird Sie auffordern, einen USB-Stick, den Sie Ihnen zukommen lassen hat, in Ihren Demonstrationsrechner einzustecken und sich mit dessen Zugriff Dateien auf dem Desktop anzusehen.
