Repository: elite-projekt/demonstrations
Catalog: demos/uhh_evil_twin/locales/*/LC_MESSAGES/*.po
Languages: de

# uhh_evil_twin_step_one_heading
source: 1. Open the WiFi settings of your phone
de: 1. Öffnen Sie die WiFi-Einstellungen Ihres Handys

# uhh_evil_twin_step_one_text
source: You should see two access points named "Nimbus Gast"
de: Sie sollten zwei Zugangspunkte mit dem Namen "Nimbus Gast" sehen

# uhh_evil_twin_step_two_heading
source: 2. Disable privacy settings
de: 2. Datenschutzeinstellungen deaktivieren

# uhh_evil_twin_step_two_text
source: To use this demo you need to disable the privacy settings for both "Nimbus Gast" access points. This is needed to identify your device and prevent other unsuspecting users to fall victim to the demonstrated attack.
de: Um diese Demo zu nutzen, müssen Sie die Datenschutzeinstellungen für beide "Nimbus Gast"-Zugangspunkte deaktivieren. Dies ist erforderlich, um Ihr Gerät zu identifizieren und zu verhindern, dass andere ahnungslose Benutzer, Opfer des demonstrierten Angriffs werden.

# uhh_evil_twin_step_three_heading
source: 3. Connect to the AP
de: 3. Verbinden Sie sich mit dem AP

# uhh_evil_twin_step_three_text
source: Connect to "Nimbus Gast" with the lock next to the Name. The password is "ELITEDEMO".
de: Verbinden Sie sich mit "Nimbus Gast" mit dem Schloss neben dem Namen. Das Passwort lautet "ELITEDEMO".

# uhh_evil_twin_step_four_heading
source: 4. Open the login page
de: 4. Öffnen Sie die Anmeldeseite

# uhh_evil_twin_step_four_text
source: A website should open automatically. If this is not the case take a look at your notifications and search for the one that prompt you to login to the WiFi network.
de: Es sollte sich automatisch eine Website öffnen. Ist dies nicht der Fall, sehen Sie sich Ihre Benachrichtigungen an und suchen Sie nach derjenigen, die Sie auffordert, sich beim WiFi-Netzwerk anzumelden.

# uhh_evil_twin_step_five_heading
source: 5. Accept the terms and conditions
de: 5. Akzeptieren Sie die Bedingungen und Konditionen

# uhh_evil_twin_step_five_text
source: Read the terms and conditions. If you agree with them check the checkbox and click the button. Your device is now registered with our system and is allowed to use the demo.
de: Lesen Sie die Bedingungen zum Nutzen der Demo durch. Wenn Sie mit ihnen einverstanden sind, aktivieren Sie das Kontrollkästchen und klicken Sie auf die Schaltfläche. Ihr Gerät ist nun in unserem System registriert und kann die Demo nutzen.

# uhh_evil_manual_button
source: To the demo instructions
de: Zur Demo-Anleitung

# uhh_evil_twin_heading
source: Device selection
de: Geräteauswahl

# uhh_evil_twin_text
source: You can either use your own device to use this demo. This requires you to follow a few steps. Alternatively you can ask a moderator to provide a device for you.
de: Sie können entweder Ihr eigenes Gerät verwenden, um diese Demo zu nutzen. Dazu müssen Sie ein paar Schritte befolgen. Alternativ können Sie auch einen Moderator bitten, Ihnen ein Gerät zur Verfügung zu stellen.

# uhh_evil_own_device_button
source: My own device
de: Eigenes Gerät

# uhh_evil_provided_device_button
source: Provided device
de: Bereitgestelltes Gerät

# uhh_evil_twin_begin_heading
source: Welcome to the "Evil Twin" demo!
de: Willkommen zur "Evil Twin" Demo!

# uhh_evil_twin_begin_text
source: You are guest at Nimbus and want to connect to their guest WiFi. They gave you the password "ELITEDEMO" for the network "Nimbus Gast". Your task is to successfully connect to the network.
de: Sie sind Gast bei Nimbus und möchten sich mit dem Gäste-WiFi verbinden. Man hat Ihnen das Passwort "ELITEDEMO" für das Netzwerk "Nimbus Gast" gegeben. Ihre Aufgabe ist es, sich erfolgreich in das Netzwerk einzuloggen.

# uhh_evil_twin_title
source: Evil Twin attack
de: Evil Twin Angriff

# uhh_evil_twin_description
source: This attack shows how easily an attacker can steal WiFi passwords
de: Bei diesem Angriff wird gezeigt wie leicht ein Angreifer WLAN-Passwörter stehlen kann

# uhh_evil_twin_guide_intro
source: This demo will show you how an attacker can create a malicious WiFi access point and steal credentials.
de: In dieser Demo wird Ihnen gezeigt, wie ein Angreifer einen Bösartiges WLAN erstellen und so Zugangsdaten stehlen kann.

# uhh_evil_twin_guide_goal
source: Your goal is to successfully connect to the guest network
de: Ihr Ziel ist es, sich erfolgreich mit dem Gast WLAN "Nimbus Gast" zu verbinden

# uhh_evil_twin_guide_req
source: For this demo a WiFi-enabled device (e.g. smartphone) is required You can either use a device prepared by us or your own device. If you want to use your own device, additional settings on your device may be required. While real attacks are shown, we cannot run malware on your device, nor steal sensitive data.
de: Für diese Demo wird ein WLAN-Fähiges Gerät (z.B. Smartphone) benötigt. Sie können entweder ein von uns vorbereitetes Gerät, oder auch Ihr eigenes Gerät nutzen. Wenn Sie ihr eigenes Gerät nutzen wollen, sind möglicherweise weitere Einstellungen auf Ihrem Gerät notwendig. Während echte Angriffe gezeigt werden, können wir weder Schadsoftware auf Ihrem Gerät ausführen, noch sensible Daten stehlen.

# uhh_evil_twin_guide_task
source: This demo is a special because it can also be run exclusively with an external device. Once you start the demo, a web page will open with the detailed instructions on how to run the demo.
de: Diese Demo ist etwas besonders, da diese auch ausschließlich mit einem externen Gerät durchgeführt werden kann. Sobald Sie die Demo starten, öffnet sich eine Webseite mit den genauen Anweisungen zum Durchführen der Demo.
