[
    {
        "id": "phishing",
        "categories": [
            "phishing",
            "email"
        ],
        "level": "beginner",
        "time": 30,
        "status": 0,
        "secureMode": false,
        "isAvailable": true,
        "messages": {
            "en": {
                "title": "Phishing",
                "description": "This demo shows security risks when dealing with phishing attempts. You will run through a short scenario from everyday office life.",
                "guide": [
                    {
                        "title": "Open Mail Program",
                        "content": "To begin please arrange this browser window to the right of your screen. Open the email application \"Thunderbird\" and arrange this window to the left side."
                    },
                    {
                        "title": "Point of View",
                        "content": "You are Max and you are employed at the company \"MPSE international\". There you are assigned as an assistant to the management. At the moment, the mood in the office is a bit tense. The management is awaiting information on government assistance regarding the COVID-19 pandemic. In addition, a popular co-worker leaves the company and the department is planning a farewell party. You ordered a gift for him and you are expecting it to arrive soon. So, this is how you start your workday and the first thing you do is check your e-mails."
                    },
                    {
                        "title": "Check Mails",
                        "content": "Go through your e-mails.\n Is there already a date for the party?\n Has the farewell gift been sent?\n Are there other important emails?"
                    },
                    {
                        "title": "End of Demo",
                        "content": "This concludes this demo. Remember that there are two different modes available on the ECS-Portal. If you want to learn more about the topic Phishing you can reach the prepared Teaching Material by clicking on the button below. To end the demo please close Thunderbird and then close this tab. After that you can start any other demo available on the ECS-portal."
                    }
                ]
            },
            "de": {
                "title": "Phishing",
                "description": "Diese Demo zeigt Sicherheitsrisiken im Umgang mit Phishing-Versuchen auf. Sie werden ein kurzes Szenario aus dem Büroalltag durchspielen.",
                "guide": [
                    {
                        "title": "Öffnen vom E-Mail Programm",
                        "content": "Um zu beginnen, ordnen Sie bitte dieses Browser-Fenster auf der rechten Seite Ihres Bildschirms an. Öffnen Sie die E-Mail-Anwendung \"Thunderbird\" und ordnen Sie dieses Fenster auf der linken Seite an."
                    },
                    {
                        "title": "Hintergrund",
                        "content": "Sie sind Max und Sie sind angestellt in der Firma \"MPSE international\". Dort sind Sie als Assistenz der Geschäftsführung eingestellt. Zur Zeit ist die Stimmung im Büro etwas angespannt. Nächste Woche findet ein Treffen mit wichtigen Geschäftspartnern statt und noch immer sind nicht alle Terminzusagen bei Ihnen eingegangen. Und das Geschenk, welches Sie im Namen der Abteilung für eine in Rente gehende Kollegin bestellt hatten,  sollte auch schon längst geliefert sein. So beginnen Sie also Ihren Arbeitstag und sehen als erstes nach Ihren E-Mails."
                    },
                    {
                        "title": "Mails überprüfen",
                        "content": "Gehen Sie Ihre E-Mails durch.\n Gibt es schon einen Termin für die Party?\n Wurde das Abschiedsgeschenk versandt?\n Gibt es sonst noch wichtige E-Mails?"
                    },
                    {
                        "title": "Ende der Demo",
                        "content": "Damit ist diese Demo beendet. Denken Sie daran, dass auf dem ECS-Portal zwei verschiedene Modi verfügbar sind. Wenn Sie mehr über das Thema Phishing erfahren möchten, können Sie das vorbereitete Lehrmaterial durch Klicken auf die Schaltfläche unten aufrufen. Um die Demo zu beenden, schließen Sie bitte Thunderbird und dann diese Registerkarte. Danach können Sie jede andere im ECS-Portal verfügbare Demo starten."
                    }
                ]
            }
        }
    },
    {
        "id": "password",
        "categories": [
            "password",
            "twoFactorAuthentication"
        ],
        "level": "intermediate",
        "time": 20,
        "status": 0,
        "secureMode": false,
        "isAvailable": true,
        "messages": {
            "en": {
                "title": "Password",
                "description": "This demo shows how secure passwords should be and how to use a second factor to make your login more secure.",
                "guide": [
                    {
                        "title": "Preparing for the Demo",
                        "content": "To get started, please go to the new browser tab that should have opened after you started the demo. If this is not the case, go to the following page in a new tab: <a href='http://localhost:5001/'>http://localhost:5001</a>. Then follow the instructions of the demo."
                    }
                ]
            },
            "de": {
                "title": "Kennwort",
                "description": "Diese Demo zeigt, wie sicher Passwörter sein sollten und wie Sie einen zweiten Faktor verwenden können, um Ihre Anmeldung sicherer zu machen.",
                "guide": [
                    {
                        "title": "Vorbereitung für die Demo",
                        "content": "Um zu beginnen, gehen Sie bitte auf den neuen Browser Tab, der sich nach dem Start der Demo geöffnet haben sollte. Wenn dies nicht der Fall ist, so rufen Sie in einem neuen Tab folgenden Seite auf: <a href='http://localhost:5001/'>http://localhost:5001</a>. Folgen Sie anschließend den Anweisungen der Demo."
                    }
                ]
            }
        }
    },
    {
        "id": "download",
        "categories": [
            "driveByDownload"
        ],
        "level": "intermediate",
        "status": 0,
        "time": 20,
        "secureMode": false,
        "isAvailable": true,
        "messages": {
            "en": {
                "title": "Drive-By Download",
                "description": "This demo shows what a drive-by download is, why it is dangerous and how you can protect yourself against it.",
                "guide": [
                    {
                        "title": "Start",
                        "content": "As soon as you start the demo, a new browser window opens. When you start the secure mode, notice that there is a red shield-shaped icon in the upper right corner of the browser window."
                    },
                    {
                        "title": "Execution",
                        "content": "Your task during this demo is to buy a printer for your company. This printer shall bring a multiscan functionality. Unsafe mode: Is it safe for you, the user, to click on the advertisements displayed in the online store? Safe mode: Click on the red shield-shaped icon in the upper right corner of your browser window and try to understand why no advertisements are displayed."
                    },
                    {
                        "title": "End",
                        "content": "After you have finished the demo by either buying the correct printer or becoming a victim of a simulated drive-by download, you can find more information about this topic in the teaching material."
                    }
                ]
            },
            "de": {
                "title": "Drive-By Download",
                "description": "Diese Demo erklärt wie ein Drive-By Download funktioniert, wo die Gefahren liegen und Sie sich davor schützen können.",
                "guide": [
                    {
                        "title": "Start",
                        "content": "Sobald Sie die Demo starten, öffnet sich ein neues Browserfenster. Achten Sie beim Start im sicheren Modus darauf, dass sich ein rotes schildförmiges Symbol in der oberen rechten Ecke des Browserfensters befindet."
                    },
                    {
                        "title": "Durchführung",
                        "content": "Ihre Aufgabe während dieser Demo ist es, einen Drucker für Ihr Unternehmen zu kaufen. Dieser soll die Funktion \"Multiscan\" besitzen. Unsicherer Modus: Ist es für Sie als Anwender sicher, auf die im Onlineshop angezeigte Werbung zu klicken? Sicherer Modus: Klicken sie auf das rote schildförmige Symbol in der oberen rechten Ecke Ihres Browserfensters und versuchen Sie nachzuvollziehen wieso Ihnen keine Werbung angezeigt wird."
                    },
                    {
                        "title": "Ende",
                        "content": "Nachdem Sie die Demo beendet haben indem Sie entweder einen richtigen Drucker gekauft oder Opfer eines simulierten Drive-By Downloads geworden sind, finden Sie weitere Information zum Thema im Teaching Material."
                    }
                ]
            }
        }
    },
    {
        "id": "fokusrnware",
        "categories": [
            "phishing",
            "email",
            "driveByDownload",
            "ransomware"
        ],
        "level": "intermediate",
        "status": 0,
        "time": 10,
        "secureMode": false,
        "isRunning": false,
        "isAvailable": true,
        "messages": {
            "en": {
                "title": "Ransomware (Malicious Website)",
                "description": "In this demo the user is confronted with a Ransomware-Attack and a Drive-by-Download as the attackvector",
                "guide": [
                    {
                        "title": "Briefing",
                        "content": "The Thunderbird e-mail client opens as soon as the demo is started. In this scenario, you play the employee Max."
                    },
                    {
                        "title": "During Demo",
                        "content": "Read through the emails which are in the inbox."
                    },
                    {
                        "title": "After Demo",
                        "content": ""
                    }
                ]
            },
            "de": {
                "title": "Ransomware (Schadhafte Website)",
                "description": "In dieser Demo wird der Nutzer mit einem Ransomware-Angriff und einem Drive-by-Download als Angriffsvektor konfrontiert.",
                "guide": [
                    {
                        "title": "Briefing",
                        "content": "Der E-Mail-Client Thunderbird wird geöffnet, sobald die Demo gestartet ist. In diesem Szenario spielen Sie den Mitarbeiter Max."
                    },
                    {
                        "title": "During Demo",
                        "content": "Lesen Sie durch die E-Mails, welche sich im Posteingang befinden."
                    },
                    {
                        "title": "After Demo",
                        "content": ""
                    }
                ]
            }
        }
    }
]