Repository: elite-projekt/demonstrations
Catalog: demos/uhh_ducky_mitm/locales/*/LC_MESSAGES/*.po
Languages: de

# uhh_usb_error_title
source: USB device not recognized (Error 10)
de: Problem mit dem USB-Gerät (Fehlercode 10)

# uhh_usb_error_msg
source: The last USB device you connected to this computer malfunctioned, and Windows does not recognize it.
de: Es ist ein Fehler bei der Enumerierung des Gerätes unterlaufen. Bitte prüfen Sie, ob das Gerät korrekt angeschlossen ist und alle Treiber installiert sind. (Fehlercode 10)

# uhh_picture_mail_subject
source: Pictures of the new premises
de: Bilder der neuen Einrichtung

# uhh_picture_mail_content
source: Hello Max, As you know, we are currently changing some of our premises. For that, i received different suggestions. Because those have become too much for me to be able to send them to you within an E-Mail because of their filesize, I send those to you on a USB-Stick. I would appreciate if you could please take a look at them and make a preselection for us. It would be sufficient for me if you could send me the corresponding file names. Thank you very much, Yours sincerely Christina
de: Hallo Max, wie du ja bereits weißt, wollen wir einige unserer Räumlichkeiten umgestalten. Hierfür habe ich verschiedene Vorschläge bekommen. Da es doch sehr viele geworden sind und sich diese aufgrund der Dateigröße nicht per E-Mail schicken lassen, habe ich dir diese auf einem USB-Stick bereitgestellt. Ich möchte dich bitten, diese anzuschauen und eine Vorauswahl für uns zu treffen. Mir würde es reichen, wenn du mir die entsprechenden Dateinamen sendest. Vielen Dank und liebe Grüße Christina

# uhh_wrong_stick_mail_subject
source: Wrong USB-Stick
de: Falscher USB-Stick

# uhh_wrong_stick_mail_content
source: Hello Max, I'm sorry, but I sent you the wrong USB stick by mistake. I just found the one with the pictures in my drawer. The one I sent you is always not recognized and I keep getting errors there. Actually I wanted to have disposed of it long ago. I am still trying to upload the photos into our system. So far there are only a few photos, but you can already have a look at them. You can find them on our website at https://nimbus.de. Due to the new guidelines against phishing attacks, I have to remind you to make sure that the URL is correct! But you should have saved the URL in your favorites. Please use the "Edge" browser for this, because the website only works properly with this browser. Kind regards Christina
de: Hallo Max, es tut mir Leid, aber ich habe dir versehentlich den falschen USB-Stick gesendet. Den mit den Bildern habe ich gerade in meiner Schublade gefunden. Der den ich dir gesendet habe wird immer nicht erkannt und ich erhalte dort ständig Fehler. Eigentlich wollte ich den schon längst entsorgt haben. Ich versuche gerade noch die Fotos in unser System hochzuladen. Bisher sind erst wenige Fotos vorhanden, aber du kannst dir ja diese bereits anschauen. Du findest diese auf unserer Webseite unter https://nimbus.de Durch die neuen Richtlinien gegen Phishing-Angriffe, muss ich dich darauf hinweisen genau zu schauen, dass die URL korrekt ist!Aber du solltest die URL ja auch in deinen Favoriten gespeichert haben. Nutze hierfür bitte den "Edge"-Browser, da die Webseite nur mit diesem einwandfrei funktioniert. Liebe Grüße Christina

# uhh_ducky_mitm_title
source: USB-Attack
de: USB-Angriff

# uhh_ducky_mitm_description
source: This demo demonstrates the dangers of attacks with manipulated USB-Sticks.
de: Diese Demo zeigt die Gefahren durch manipulierte USB-Sticks auf und wie diese über eine lange Zeit unbemerkt Daten aus dem Firmennetz transportieren können.

# uhh_ducky_mitm_guide_intro
source: In this demo you will learn about the dangers of unknown USB devices. For this, you will be asked by an employee to look at pictures on a USB stick.
de: In dieser Demo lernen Sie die Gefahren von unbekannten USB-Geräten kennen. Hierfür werden Sie von einer Mitarbeiterin aufgefordert, sich Bilder auf einem USB-Stick anzuschauen.

# uhh_ducky_mitm_guide_goal
source: At the end of the demo, your internal company login of the demonstration will be compromised by attackers. The demonstration ends when you have logged in to the internal company website with any data.
de: Am Ende der Demo wird ihr interner Firmenlogin der Demonstration durch Angreifer kompromittiert sein. Die Demonstration endet, wenn Sie sich auf der Firmeninternen Webseite mit beliebigen Daten eingeloggt haben.

# uhh_ducky_mitm_guide_req
source: This demo requires a demonstration USB stick, which will be given to you by our moderators.
de: Für diese Demo wird ein Demonstrations-USB-Stick benötigt, der Ihnen von unseren Moderatoren ausgehändigt wird.

# uhh_ducky_mitm_guide_task
source: Your task in this demo is to follow the instructions in the emails from Christina Sauer. She will ask you to insert a USB stick, which she has sent you, into your demonstration computer. This USB stick contains images that are necessary to complete the task.
de: Ihre Aufgabe in dieser Demo besteht darin, der Anleitung in den E-Mails von Christina Sauer zu folgen. Diese wird Sie auffordern, einen USB-Stick, welchen Sie Ihnen zukommen lassen hat, in Ihren Demonstrationsrechner einzustecken. Dieser USB-Stick enhält Bilder, welches zum Bearbeiten der Aufgabe notwendig sind.

# uhh_project_mail_subject
source: What did you do to my project?!
de: Was hast du mit meinem Projekt gemacht?!

# uhh_project_mail_content
source: Hello Max, why did I just get the message that you deleted my project? I just gave you the access to fix possible spelling mistakes, but not to delete everything!!! Please get back to me as soon as possible! Alex
de: Hallo Max, wieso habe ich gerade die Meldung erhalten, dass du mein Projekt gelöscht hast? Ich habe dir den Zugriff nur gegeben, damit du mögliche Rechtschreibfehler behebst, aber nicht um alles zu löschen!! Bitte melde dich so schnell wie möglich bei mir! Alex

# uhh_backup_mail_subject
source: IMPORTANT! Why was the backup deleted?
de: WICHTIG! Warum wurde das Backup gelöscht?

# uhh_backup_mail_content
source: Hello Max, can you please explain to me right away why you deleted our backups? These are extremely important for us. Please contact me IMMEDIATELY! Emma
de: Hallo Max, kannst du mir bitte sofort erklären, wieso du unsere Backups gelöscht hast? Diese sind extrem wichtig für uns. Melde dich bitte SOFORT bei mir! Emma

# uhh_admin_mail_subject
source: Suspicious connections from your computer
de: Verdächtige Verbindungen von Ihrem Rechner

# uhh_admin_mail_content
source: Dear Mr. Mustermann, We currently have numerous warnings that a large amount of data is being transferred from your PC to an external server. Please let us know immediately if you have initiated this. Yours sincerely Nimbus Administrators
de: Sehr geehrter Herr Mustermann, uns liegen aktuell zahlreiche Warnungen vor, dass von Ihrem PC aus eine große Menge an Daten an einen externen Server übertragen werden. Bitte teilen Sie uns unverzüglich mit, ob Sie dies eingeleitet haben. Mit freundlichen Grüßen Nimbus Administratoren

# uhh_internal_mail_subject
source: Access data for the customer database
de: Zugangsdaten für die Kundendatenbank

# uhh_internal_mail_content
source: Hello Max, enclosed you will find the access data for the customer database you just requested from me. Username: kunden_db Password: 73ioi2em9JIYddo3CdZ3AY6VQuD6GG1t If it does not work, please contact me. Kind regards Mia
de: Hallo Max, anbei findest du die Zugangsdaten für die Kundendatenbank, die du gerade bei mir angefragt hast. Nutzername: kunden_db Passwort: 73ioi2em9JIYddo3CdZ3AY6VQuD6GG1t Wenn es nicht funktionieren sollte, melde dich bitte bei mir. Liebe Grüße Mia

# uhh_it_test_mail_subject
source: All-clear! Results of the IT security test
de: Entwarnung! Ergebnisse des IT-Security-Tests

# uhh_it_test_mail_content
source: Dear Mr. Mustermann, Thank you for participating in our IT security test! The aim of this test is to sensitize employees to various attacks. In this scenario, you have connected a damaged USB stick, which has installed malware on your computer. An attacker is able to read and write all data on your computer. This also makes it possible to cut and modify all communication. To see what exactly has happened and which access data has been intercepted, just visit our status page at https://nimbus.de/status. We will inform you about further steps in the next days. With best regards Your IT Security Team
de: Sehr geehrter Herr Mustermann, vielen Dank für die Teilnahme an unserem IT-Security-Test! Dieser hat das Ziel die Mitarbeiter für verschiedene Angriffe zu sensibilisieren. Bei diesem Szenario haben Sie einen schadhaften USB-Stick angeschlossen, welcher eine Schadsoftware auf Ihrem Rechner installiert hat. Ein Angreifer ist damit in der Lage alle Daten auf ihrem Rechner zu lesen und schreiben. Dadurch ist es auch möglich sämtliche Kommunikation mit zuschneiden und zu verändern. Um zu sehen was genau passiert ist und welche Zugangsdaten mitgeschnitten wurden, besuchen Sie einfach unsere Statusseite unter https://nimbus.de/status Wir werden Sie in den nächsten Tagen über weitere Schritte informieren. Mit freundlichen Grüßen Ihr Team IT-Security

# nimbus_login_header
source: Login
de: Anmeldung

# nimbus_login_text
source: Please login using your Nimbus Account-Service credentials
de: Bitte melden Sie sich mit Ihren Zugangsdaten für Nimbus Account-Services an

# nimbus_username
source: Username
de: Benutzername

# nimbus_password
source: Password
de: Passwort

# nimbus_login_button
source: Login
de: Anmelden

# uhh_web_loading
source: Loading images
de: Lade Bilder

# uhh_web_loading_error
source: Error: Got corrupted data
de: Fehler beim Laden der Bilder

# uhh_web_stolen_data
source: Stolen credentials
de: Gestohlene Daten

# uhh_web_table_before_link
source: This table shows what credentials the attacker has learned about you. If you visit the
de: Diese Tabelle zeigt, welche Zugangsdaten der Angreifer über Sie in Erfahrung gebracht hat. Wenn Sie auf der

# uhh_web_table_after_link
source: and enter additional credentials, they will appear in this table.
de: weitere Daten eingeben, tauchen diese in dieser Tabelle auf.

# uhh_web_table_link
source: Nimbus Login Site
de: Nimbus Login Seite

# uhh_web_status_before_button
source: In case you have not seen it: When plugging in the "defective" USB stick, we were able to execute arbitrary commands and thus infected your PC. You can exit the demo now, or take a look at the technical background of the attack on this page.
de: Falls Sie es nicht gesehen haben: Beim Einstecken des "defekten" USB-Sticks konnten wir beliebige Befehle ausführen und haben so ihren PC infiziert. Sie können die Demo jetzt beenden, oder sich auf dieser Seite die technischen Hintergründe des Angriffes anschauen.

# uhh_web_status_after_button
source: We used the attack to change the proxy settings of the operating system and install a fake certificate. If you look at the address bar, you can see that it is the correct URL. However, if you look at the certificate, you can see that it is not legitimate and issued to "mitmproxy". To see this, you can click on the lock next to the address bar and then view the connection status. Here, click on the certificate icon (next to the "X").
de: Wir haben den Angriff genutzt, um die Proxy-Einstellungen des Betriebssystems zu ändern und ein falsches Zertifikat zu installieren. Wenn Sie auf die Adressleiste schauen, sehen Sie, dass es sich um die korrekte URL handelt. Schaut man sich jedoch das Zertifikat an, erkennt man, dass dieses nicht legitim und auf "mitmproxy" ausgestellt ist. Um dies anzuzeigen, können Sie auf das Schloss neben der Adressleiste klicken und sich dann den Verbindungsstatus anzeigen lassen. Hier auf das Zertifikatssymbol (neben dem "X") klicken.

# uhh_web_status_button
source: Stop Demo
de: Demo Stoppen

# uhh_web_status_after_images
source: This certificate is obviously not a legitimate one and with it we are able to read and manipulate all encrypted traffic. Additionally, we have changed the proxy settings, which causes the traffic to be routed through a server from the attacker.
de: Dieses Zertifikat ist offensichtlich kein legitimes und mit diesem sind wir in der Lage allen verschlüsselten Datenverkehr zu lesen und zu manipulieren. Zusätzlich haben wir die Proxy-Einstellungen geändert, wodurch der Datenverkehr über einen Server vom Angreifer geleitet wird.
